# Install MySql
    1. sudo apt update
    2. sudo apt upgrade
    3. sudo apt install mysql-server
    4. mysql --version
    
    Password
    1. sudo mysql -u root
    2. USE mysql;
    3. ALTER USER 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY 'yourpass';
    
# Install Mysql.connector (Python Library)
    python -m pip install mysql-connector-python

# Import Library

In [1]:
import mysql.connector

# creating a connection

In [3]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="pass"
)
mycursor = mydb.cursor()

# Create new Dataset

In [4]:
sql = "CREATE DATABASE database1"
mycursor.execute(sql)

# Show all Datasets

In [5]:
mycursor = mydb.cursor()

In [6]:
sql1 = "SHOW DATABASES"
mycursor.execute(sql1)

In [8]:
mycursor.fetchall()

# Remove a Dataset

In [9]:
sql1 = "DROP DATABASE database1"
mycursor.execute(sql1)

# Connecting to "online_shop"

In [10]:
mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="pass",
    database = "online_shop"
)

In [11]:
mycursor = mydb.cursor()

# Creating tables

In [8]:
sql = """
        CREATE TABLE Users(
        user_id int NOT NULL auto_increment,
        first_name varchar(255),
        last_name varchar(255) NOT NULL,
        age int,
        PRIMARY KEY (user_id)
        );
    """

In [2]:
mycursor.execute(sql)

In [ ]:
sql = """
        CREATE TABLE Orders(
        order_id int NOT NULL auto_increment,
        name varchar(255) NOT NULL,
        price int NOT NULL,
        user_id int NOT NULL,
        PRIMARY KEY (order_id),
        FOREIGN KEY (user_id) REFERENCES Users (user_id)
        );
    """

In [ ]:
mycursor.execute(sql)

# Show Tables

In [12]:
sql = "SHOW TABLES"
mycursor.execute(sql)

In [13]:
mycursor.fetchall()

[('Orders',), ('Users',)]

## DROP TABLE

In [15]:
sql1 = "DROP TABLE Orders"
#mycursor.execute(sql1)

# Insert data

In [16]:
sql = "INSERT INTO Users (first_name, last_name, age) VALUES ('a', 'b', 12)"

In [17]:
mycursor.execute(sql)

In [18]:
mydb.commit()

In [19]:
sql = """
        INSERT INTO Orders (name, price, user_id)
        VALUES
        ('p1', 100, 1),
        ('p2', 200, 1),
        ('p3', 300, 2)
        
    """

In [20]:
mycursor.execute(sql)

In [21]:
mydb.commit()

# Select

In [22]:
sql = "SELECT * FROM Orders WHERE name = 'p2'"
mycursor.execute(sql)

In [23]:
mycursor.fetchall()

[(2, 'p2', 200, 1), (5, 'p2', 200, 1)]

In [24]:
sql = "SELECT * FROM Orders WHERE name LIKE 'p%'"
mycursor.execute(sql)

In [25]:
mycursor.fetchall()

[(1, 'p1', 100, 1),
 (2, 'p2', 200, 1),
 (3, 'p3', 300, 2),
 (4, 'p1', 100, 1),
 (5, 'p2', 200, 1),
 (6, 'p3', 300, 2)]

# Remove data

In [26]:
# DELETE FROM TABLE_NAME WHERE conditon
sql = "DELETE FROM Users WHERE user_id = 3"
mycursor.execute(sql)

In [27]:
sql = "DELETE FROM Orders WHERE name LIKE '%2%'"
mycursor.execute(sql)

# Update data

In [28]:
sql = "SELECT * FROM Orders"
mycursor.execute(sql)

In [29]:
mycursor.fetchall()

[(1, 'p1', 100, 1), (3, 'p3', 300, 2), (4, 'p1', 100, 1), (6, 'p3', 300, 2)]

In [30]:
sql = """UPDATE Orders SET price = 0.1 * price + price
            WHERE price > 300
        """
mycursor.execute(sql)

# Join

## INNER JOIN

In [31]:
sql = """
        SELECT first_name, name FROM Orders INNER JOIN Users
        ON Orders.user_id = Users.user_id
    """
mycursor.execute(sql)

In [32]:
mycursor.fetchall()

[('ali', 'p1'), ('sara', 'p3'), ('ali', 'p1'), ('sara', 'p3')]

# LEFT JOIN

In [33]:
sql = """
        SELECT first_name, name FROM Users LEFT JOIN Orders 
        ON Orders.user_id = Users.user_id
    """
mycursor.execute(sql)

In [34]:
mycursor.fetchall()

[('ali', 'p1'),
 ('ali', 'p1'),
 ('sara', 'p3'),
 ('sara', 'p3'),
 ('aaa', None),
 ('aaa', None),
 ('a', None)]

## RIGHT JOIN

In [35]:
sql = """
        SELECT first_name, name FROM Orders RIGHT JOIN Users
        ON Orders.user_id = Users.user_id
    """
mycursor.execute(sql)

In [36]:
mycursor.fetchall()

[('ali', 'p1'),
 ('ali', 'p1'),
 ('sara', 'p3'),
 ('sara', 'p3'),
 ('aaa', None),
 ('aaa', None),
 ('a', None)]